too1/nrf52-ble-pong-central/main.c
/** @brief Function for initializing the timer.
 */
static void timer_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling events from the GATT library. */
void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt)
{
    uint32_t data_length;
    if (/*(m_conn_handle == p_evt->conn_handle) &&*/ (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED))
    {
        data_length = p_evt->params.att_mtu_effective - 3 - 2;
        //m_ble_params_info.mtu = m_ble_its_max_data_len;
        
        NRF_LOG_INFO("gatt_event: ATT MTU is set to 0x%X (%d)", data_length, data_length);
    }
    else if (/*(m_conn_handle == p_evt->conn_handle) && */(p_evt->evt_id == NRF_BLE_GATT_EVT_DATA_LENGTH_UPDATED))
    {
        data_length = p_evt->params.att_mtu_effective - 3 - 2 - 4;
        
        NRF_LOG_INFO("gatt_event: Data len is set to 0x%X (%d)", data_length, data_length);
    }
    //NRF_LOG_DEBUG("ATT MTU exchange completed. central 0x%x peripheral 0x%x",
      //            p_gatt->att_mtu_desired_central,
        //        p_gatt->att_mtu_desired_periph);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, 247);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_gatt_data_length_set(&m_gatt, BLE_CONN_HANDLE_INVALID, NRF_SDH_BLE_GAP_DATA_LENGTH);
    APP_ERROR_CHECK(err_code);
}

static void app_pong_event_handler(pong_event_t *evt)
{
    switch(evt->evt_type)
    {
        case PONG_EVENT_GAMESTATE_UPDATE:
            app_pong_draw_display();
            break;
            
        case PONG_EVENT_CON_SET_COLOR:
            if(evt->params.con_set_color.conn_handle < PONG_NUM_PLAYERS)
            {
                uint32_t color = evt->params.con_set_color.color;
                ble_thingy_uis_led_set_constant(&m_thingy_uis_c[evt->params.con_set_color.conn_handle], color >> 16, (color >> 8) & 0xFF, color & 0xFF);
            }
            break;
            
        case PONG_EVENT_PLAY_SOUND:
            if(m_sound_enabled)
            {
                ble_thingy_tss_spk_data_sample_send(&m_thingy_tss_c[evt->params.play_sound.controller_index], evt->params.play_sound.sample_id);
            }
            break;

        case PONG_EVENT_GAME_STARTED:
            ble_per_manager_on_game_started(0);
            break;

        case PONG_EVENT_POINT_SCORED:
            ble_per_manager_on_point_scored(evt->params.point_scored.player_index);
            break;

        case PONG_EVENT_GAME_OVER:
            ble_per_manager_on_game_over(evt->params.game_over.winner_index);
            break;

        default:
            break;
    }
}

static void pong_init(void)
{
    for(int i = 0; i < PONG_NUM_PLAYERS; i++)
    {
        app_pong_get_controller(i)->paddle_x = 50;
    }
    pong_config_t config;
    config.event_handler = app_pong_event_handler;
    app_pong_init(&config);
}

void uart_error_handle(app_uart_evt_t * p_event)
{
    if (p_event->evt_type == APP_UART_COMMUNICATION_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_communication);
    }
    else if (p_event->evt_type == APP_UART_FIFO_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_code);
    }
}

static void uart_init(void)
{
    uint32_t err_code;
     const app_uart_comm_params_t comm_params =
      {
          RX_PIN_NUMBER,
          TX_PIN_NUMBER,
          RTS_PIN_NUMBER,
          CTS_PIN_NUMBER,
          APP_UART_FLOW_CONTROL_DISABLED,
          false,
#if defined (UART_PRESENT)
          UART_BAUDRATE_BAUDRATE_Baud460800
#else
          NRF_UARTE_BAUDRATE_115200
#endif
      };

    APP_UART_FIFO_INIT(&comm_params,
                         16,
                         128,
                         uart_error_handle,
                         APP_IRQ_PRIORITY_LOWEST,
                         err_code);

    APP_ERROR_CHECK(err_code);   
}

#define PERF_ENABLE 0

#define PERF_UPDATE_MS  250
#define PERF_REF_COUNT  284400
#define PERF_RUN()      NRF_TIMER3->TASKS_COUNT = 1

static void perf_update(void *p)
{
    NRF_TIMER3->TASKS_CAPTURE[0] = 1;
    NRF_LOG_INFO("Perf: %i", (((NRF_TIMER3->CC[0]) * 1000 / PERF_REF_COUNT)));
    NRF_TIMER3->TASKS_CLEAR = 1;
}

static void perf_init(void)
{
#if (PERF_ENABLE == 1)
    app_timer_create(&m_app_timer_perf_update, APP_TIMER_MODE_REPEATED, perf_update);
    app_timer_start(m_app_timer_perf_update, APP_TIMER_TICKS(PERF_UPDATE_MS), 0);
    
    NRF_TIMER3->MODE = TIMER_MODE_MODE_Counter << TIMER_MODE_MODE_Pos;
    NRF_TIMER3->BITMODE = TIMER_BITMODE_BITMODE_32Bit << TIMER_BITMODE_BITMODE_Pos;
    NRF_TIMER3->TASKS_START = 1;
#endif
}


void peripheral_callback(ble_per_manager_event_t *event)
{
    switch(event->evt_type)
    {
        case BLE_PER_MNG_EVT_CONNECTED:
            NRF_LOG_INFO("Phone connected");
            
            // TODO: Figure out why this can't be called just after connection. q
            forward_controller_state_to_central();
            
            break;

        case BLE_PER_MNG_EVT_DISCONNECTED:
            NRF_LOG_INFO("Phone disconnected");
            break;

        case BLE_PER_MNG_EVT_DATA_RECEIVED:
            //NRF_LOG_INFO("Phone data received!!!!");
            //NRF_LOG_HEXDUMP_INFO(event->data_ptr, event->data_length);
            switch(event->data_ptr[0])
            {
                case BLE_PER_MNG_RX_CMD_START_GAME:
                    app_pong_start_tournament_round(event->data_ptr + 1, event->data_length - 1);
                    break;

                case BLE_PER_MNG_RX_CMD_RESET_PONG:
                    NVIC_SystemReset();
                    break;

                case BLE_PER_MNG_RX_CMD_SET_GAME_CONFIG:
                    m_sound_enabled = (event->data_ptr[1] != 0);
                    break;

                case BLE_PER_MNG_RX_CMD_PLAYER_PIC_DUMP:
                    app_pong_forward_data_dump(event->data_ptr, 0);
                    break;
            }

            break;

        case BLE_PER_MNG_EVT_DATA_DUMP_RECEIVED:
            app_pong_forward_data_dump(event->data_ptr, event->data_length);
            break;
    }
}


static void peripheral_init(void)
{
    ble_per_manager_config_t config;
    config.callback = peripheral_callback;
    ble_per_manager_init(&config);
}

int main(void)
{
    // Initialize.
    log_init();
    timer_init();
    leds_init();
    uart_init();
    buttons_init();
    power_management_init();
    ble_stack_init();
    gatt_init();
    db_discovery_init();
    thingy_c_init();
    ble_conn_state_init();

    // Start execution.
    NRF_LOG_INFO("Thingy Pong started.");
    
    perf_init();   
    
    scan_start();
    
    peripheral_init();

    app_display_init();

    pong_init();

    app_pong_start_game();
    
    ble_per_manager_start_advertising();
    
    for (;;)
    {
#if (PERF_ENABLE == 1)
        PERF_RUN();
        NRF_LOG_PROCESS();
#else
        idle_state_handle();
#endif
    }
}
